/*本题要求编写程序，按照规定格式输出表格。
输入格式：
  本题目没有输入。
输出格式：
  要求严格按照给出的格式输出下列表格：
------------------------------------
Province      Area(km2)   Pop.(10K)
------------------------------------
Anhui         139600.00   6461.00
Beijing        16410.54   1180.70
Chongqing      82400.00   3144.23
Shanghai        6340.50   1360.26
Zhejiang      101800.00   4894.00
------------------------------------
*/
fun main(args: Array<String>) {
  println("------------------------------------")
  println("Province      Area(km2)   Pop.(10K)")
  println("------------------------------------")
  println("Anhui         139600.00   6461.00")
  println("Beijing        16410.54   1180.70")
  println("Chongqing      82400.00   3144.23")
  println("Shanghai        6340.50   1360.26")
  println("Zhejiang      101800.00   4894.00")
  println("------------------------------------")
}
